[
  {
    "image": "https://i.ibb.co.com/SX17R7ks/Whats-App-svg.png",
    "title": "WhatsApp Messenger",
    "companyName": "Meta Platforms Inc.",
    "id": 1,
    "description": "WhatsApp Messenger represents one of the most revolutionary communication platforms in the digital age, fundamentally transforming how people connect across the globe. This comprehensive messaging application enables users to send text messages, voice notes, high-quality photos, and videos instantly without any cost beyond internet connectivity. The platform's sophisticated end-to-end encryption technology ensures that all conversations remain completely private and secure, protecting user data from unauthorized access. WhatsApp supports dynamic group chats that can accommodate up to 256 participants, making it ideal for family gatherings, business collaborations, community organizations, and social groups. The application's voice and video calling features provide crystal-clear communication quality, allowing users to make international calls without incurring traditional telephone charges. Additional functionalities include document sharing capabilities for PDFs, spreadsheets, and presentations up to 100MB, location sharing for meetups and navigation, and WhatsApp Web for seamless computer integration. The Status feature enables users to share text, photo, and video updates that disappear after 24 hours, similar to stories on other social platforms. WhatsApp Business provides specialized tools for enterprises, including automated responses, product catalogs, and business profiles. The platform continuously evolves with new features like disappearing messages that automatically vanish after seven days, view-once media for enhanced privacy, and multi-device support that allows using WhatsApp without keeping your phone connected. With its minimalist interface, reliable performance, and commitment to privacy, WhatsApp has become an indispensable tool for personal and professional communication worldwide, bridging distances and fostering connections in an increasingly digital society.",
    "size": 120,
    "reviews": "56M",
    "ratingAvg": 4.3,
    "downloads": "5B",
    "ratings": [
      { "name": "1 star", "count": 2300000 },
      { "name": "2 star", "count": 1500000 },
      { "name": "3 star", "count": 4000000 },
      { "name": "4 star", "count": 9000000 },
      { "name": "5 star", "count": 39000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/kVFPDd6x/Instagram-logo-2022-svg.png",
    "title": "Instagram",
    "companyName": "Meta Platforms Inc.",
    "id": 2,
    "description": "Instagram has revolutionized visual storytelling and digital self-expression since its inception, creating a vibrant ecosystem where creativity meets community. This multifaceted platform enables users to share beautifully curated photos, engaging Stories that disappear after 24 hours, and compelling short-form videos through Reels. The Explore page employs sophisticated algorithms to help users discover trending content, niche communities, and creators aligned with their interests, while the Shop feature transforms the app into a dynamic marketplace where users can browse and purchase products directly from brands and creators. Instagram's robust creator tools include professional editing filters, augmented reality effects, scheduling capabilities, and comprehensive analytics for business accounts. The platform fosters genuine connections through direct messaging, group chats, and collaborative features like co-watching and joint Live broadcasts. Instagram Guides provide in-depth content curation for travel destinations, products, and educational topics, while the Archive feature allows users to hide posts from their profile without permanently deleting them. For content creators, Instagram offers multiple monetization opportunities including badges during Live videos, affiliate marketing, and the Professional Dashboard for tracking performance metrics. The platform's commitment to safety includes advanced comment filtering, bullying prevention tools, and mental health resources. Instagram continuously innovates with features like Close Friends for sharing exclusive content, QR codes for easy profile sharing, and various interactive stickers for polls, questions, and quizzes in Stories. With its powerful blend of visual appeal, community engagement, and commercial functionality, Instagram has established itself as more than just a social network—it's a cultural phenomenon that shapes trends, launches careers, and connects people through shared visual experiences in our increasingly digital world.",
    "size": 180,
    "reviews": "48M",
    "ratingAvg": 4.4,
    "downloads": "5B",
    "ratings": [
      { "name": "1 star", "count": 1800000 },
      { "name": " 2 star", "count": 1300000 },
      { "name": "3 star", "count": 5000000 },
      { "name": "4 star", "count": 11000000 },
      { "name": "5 star", "count": 37000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/v6dkyDpW/You-Tube-full-color-icon-2017-svg.png",
    "title": "YouTube",
    "companyName": "Google LLC",
    "id": 3,
    "description": "YouTube stands as the unparalleled titan of video content consumption and creation, fundamentally reshaping global media landscapes and entertainment industries. As the world's second-largest search engine and premier video-sharing platform, YouTube hosts an astonishing diversity of content spanning music videos, educational tutorials, gaming streams, news broadcasts, documentary films, and user-generated vlogs. The platform's sophisticated recommendation algorithm personalizes the viewing experience by suggesting content based on watch history, engagement patterns, and user preferences. Content creators benefit from YouTube's Partner Program, which enables revenue generation through advertising, channel memberships, Super Chat donations during live streams, and merchandise shelf integration. YouTube Premium offers an enhanced experience with ad-free viewing, background play, and access to YouTube Originals exclusive content. The platform supports multiple video formats including standard uploads, 360-degree videos, virtual reality content, and 4K resolution streaming. YouTube Live facilitates real-time broadcasting for events, tutorials, and interactions, while YouTube Kids provides a safer, curated environment for younger audiences. The platform's educational arm, YouTube Learning, promotes skill development through structured courses and tutorials from verified educators. Content management tools include comprehensive analytics dashboards, copyright protection through Content ID system, and community guidelines enforcement. YouTube Studio serves as the central hub for creators to manage their channels, analyze performance metrics, and engage with their audience through comments and community posts. The platform has become an essential tool for businesses, educators, artists, and entertainers alike, offering global reach and powerful engagement tools. With its continuous innovation in video technology, commitment to creator empowerment, and vast content library, YouTube has transcended its original purpose to become an indispensable digital public square where information, entertainment, and education converge to inform, inspire, and connect billions of people worldwide.",
    "size": 150,
    "reviews": "120M",
    "ratingAvg": 4.5,
    "downloads": "10B",
    "ratings": [
      { "name": "1 star", "count": 3500000 },
      { "name": "2 star", "count": 2000000 },
      { "name": "3 star", "count": 8000000 },
      { "name": "4 star", "count": 16000000 },
      { "name": "5 star", "count": 90000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/PGNRzkZK/download.png",
    "title": "TikTok",
    "companyName": "ByteDance Ltd.",
    "id": 4,
    "description": "TikTok has emerged as the defining social media phenomenon of the contemporary digital era, revolutionizing short-form video entertainment and creator culture across global demographics. This dynamic platform specializes in vertical videos ranging from 15 seconds to 10 minutes, powered by an exceptionally sophisticated recommendation algorithm that curates the iconic For You Page with hyper-personalized content. Users can create engaging videos using an extensive library of popular audio tracks, innovative visual effects, green screen technology, voice filters, and timed text overlays. The platform's intuitive editing tools enable seamless video stitching, speed adjustments, transitions, and beauty filters that require no professional editing experience. TikTok's duet and stitch features facilitate creative collaboration by allowing users to build upon existing content, while challenges and trends create viral moments that unite communities worldwide. The platform has become a launchpad for musical careers, comedy sketches, educational content, dance routines, and social activism. TikTok LIVE enables real-time interaction through Q&A sessions, gaming streams, and virtual gifts that creators can monetize. The Creator Fund and TikTok Pulse revenue sharing program provide financial incentives for popular content producers, while TikTok Shop integrates e-commerce directly into the viewing experience. Business accounts gain access to advanced analytics, promotional tools, and advertising solutions tailored to reach specific demographics. Safety features include comprehensive privacy controls, comment filters, family pairing for teen accounts, and digital wellbeing tools. TikTok's educational initiatives like #LearnOnTikTok have transformed the platform into a knowledge-sharing hub where experts simplify complex topics through engaging formats. With its unparalleled ability to make content go viral, democratize fame, and foster authentic connections, TikTok has transcended being merely an app to become a cultural force that shapes music charts, defines trends, and gives voice to creative expression in the modern digital landscape.",
    "size": 200,
    "reviews": "45M",
    "ratingAvg": 4.2,
    "downloads": "3B",
    "ratings": [
      { "name": "1 star", "count": 2500000 },
      { "name": "2 star", "count": 1200000 },
      { "name": "3 star", "count": 4000000 },
      { "name": "4 star", "count": 7000000 },
      { "name": "5 star", "count": 32000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/4ZrghPSQ/images.png",
    "title": "Facebook",
    "companyName": "Meta Platforms Inc.",
    "id": 5,
    "description": "Facebook maintains its position as the foundational pillar of modern social networking, continuously evolving while preserving its core mission of connecting people across geographical and cultural boundaries. This comprehensive platform enables users to maintain personal profiles, share life updates through photos and status posts, and cultivate digital communities through Groups focused on countless interests, hobbies, and causes. The News Feed algorithm curates content from friends, family, followed Pages, and Groups while prioritizing meaningful interactions. Facebook's robust Events system facilitates planning, invitation management, and discovery of local happenings, while Memories resurface past posts to celebrate digital anniversaries. The platform's Marketplace serves as a massive classifieds section where users can buy and sell items locally, complemented by Jobs listings for employment opportunities. Facebook Watch provides original video content and user-generated videos, while Gaming supports live streams and esports communities. Privacy Center offers transparent control over data settings, audience selectors for each post, and timeline review features. Business Manager empowers companies with advanced advertising tools, audience insights, Page analytics, and customer service integration through Messenger. The platform's safety features include harassment prevention tools, suicide prevention resources, fake news identification, and election integrity initiatives. Facebook's continuous innovation introduces features like Avatar creation for personalized digital representations, Climate Science Center for environmental education, and Blood Donations for connecting donors with local needs. As the corporate flagship of Meta's vision for the metaverse, Facebook is transitioning toward increasingly immersive experiences while maintaining its essential function as the digital town square where relationships are nurtured, information is exchanged, and communities are strengthened through shared experiences and mutual connections in our increasingly interconnected global society.",
    "size": 250,
    "reviews": "88M",
    "ratingAvg": 4.1,
    "downloads": "5B",
    "ratings": [
      { "name": "1 star", "count": 5000000 },
      { "name": "2 star", "count": 3000000 },
      { "name": "3 star", "count": 7000000 },
      { "name": "4 star", "count": 10000000 },
      { "name": "5 star", "count": 63000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/8nG2gyBs/download-1.png",
    "title": "Spotify",
    "companyName": "Spotify AB",
    "id": 6,
    "description": "Spotify has fundamentally transformed music consumption and audio entertainment, establishing itself as the world's most comprehensive streaming platform with an unparalleled catalog of over 70 million tracks and 2.6 million podcast titles. The service's sophisticated recommendation engine analyzes listening habits to generate personalized playlists like Discover Weekly, Release Radar, and Daily Mixes that introduce users to new artists aligned with their musical tastes. Spotify's freemium model provides ad-supported access to the entire library, while Premium subscriptions unlock offline downloads, unlimited skips, high-quality audio streaming up to 320 kbps, and on-demand playback. The platform's social features include collaborative playlists, friend activity feeds, and Spotify Codes for easy music sharing. For artists, Spotify for Artists offers detailed analytics about listeners, playlist placements, and royalty tracking, while Canvas allows musicians to add looping visual artwork to their tracks. Podcast creators benefit from Anchor integration for easy publishing, video podcast support, and subscription monetization options. Spotify's unique audio features include Crossfade for seamless transitions between songs, Sleep Timer for bedtime listening, and Car View for simplified driving interface. The platform continuously innovates with features like Spotify Greenroom for live audio conversations, Spotify Kids for family-friendly content, and Spotify Lite for regions with limited data connectivity. Educational content through Spotify for Learning Partners and wellness programming through meditation guides expand the platform's utility beyond entertainment. With its robust API enabling third-party integrations, hardware compatibility across thousands of devices, and commitment to artist discovery through editorial playlists and algorithmic recommendations, Spotify has revolutionized how we discover, share, and experience audio content while supporting the creative ecosystem through fair compensation models and promotional tools that benefit both emerging and established artists in the digital age.",
    "size": 110,
    "reviews": "32M",
    "ratingAvg": 4.6,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": 1000000 },
      { "name": "2 star", "count": 800000 },
      { "name": "3 star", "count": 2500000 },
      { "name": "4 star", "count": 6000000 },
      { "name": "5 star", "count": 22000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/fY1BQqDK/download-2.png",
    "title": "Netflix",
    "companyName": "Netflix Inc.",
    "id": 7,
    "description": "Netflix has redefined entertainment consumption through its pioneering streaming service that offers an unprecedented library of movies, television series, documentaries, and exclusive original content across virtually every genre and language. The platform's sophisticated recommendation algorithm analyzes viewing history, ratings, and similar user preferences to surface personalized suggestions through rows like Trending Now, Because You Watched, and Top Picks. Netflix Original programming has revolutionized television with critically acclaimed series, films, and specials that have garnered numerous awards while pushing creative boundaries. The service supports multiple user profiles within each account, with customizable avatars and maturity level controls for family viewing. Advanced playback features include variable speed control, skip intro functionality, and downloadable content for offline viewing during travel or limited connectivity. Netflix's global content strategy includes international productions with subtitles and dubbing in numerous languages, making foreign-language entertainment accessible worldwide. The platform's interactive storytelling experiments with choose-your-own-adventure style programming, while its comedy specials often feature top comedians in the industry. For filmmakers and creators, Netflix provides production resources and global distribution unmatched by traditional studios. The service continuously enhances video quality with support for 4K Ultra HD, HDR10, Dolby Vision, and Dolby Atmos audio on compatible devices. Netflix's mobile plan offers affordable streaming to smartphones, while the premium tier supports simultaneous streaming on four devices with the highest video quality available. Through its commitment to diverse storytelling, technological innovation in streaming delivery, and substantial investment in original content, Netflix has not only transformed how audiences consume entertainment but has also reshaped the entire television and film industry, making premium content accessible anywhere, anytime, without commercial interruptions, and establishing new paradigms for creative expression in the digital era.",
    "size": 170,
    "reviews": "25M",
    "ratingAvg": 4.5,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": 800000 },
      { "name": "2 star", "count": 500000 },
      { "name": "3 star", "count": 1500000 },
      { "name": "4 star", "count": 5000000 },
      { "name": "5 star", "count": 17000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/1JX0tGpD/Gmail-icon-2020-svg.png",
    "title": "Gmail",
    "companyName": "Google LLC",
    "id": 8,
    "description": "Gmail stands as the world's most sophisticated and reliable email service, seamlessly integrating powerful communication tools with intuitive organization features that redefine productivity in the digital age. The platform's clean, adaptive interface provides a clutter-free experience across devices while offering advanced functionality through its integration with Google Workspace. Gmail's industry-leading spam filtering employs artificial intelligence to automatically detect and quarantine malicious messages with remarkable accuracy, protecting users from phishing attempts and unwanted promotions. The service organizes incoming mail through a sophisticated tab system that categorizes messages into Primary, Social, Promotions, and Updates, ensuring important communications remain easily accessible. Gmail's search functionality leverages Google's powerful search technology to quickly locate specific emails using natural language queries, sender filters, date ranges, and attachment types. Smart Compose and Smart Reply features use machine learning to suggest complete sentences and responses, significantly accelerating email composition. The platform supports seamless attachment of files from Google Drive, with the ability to send documents up to 10GB through secure cloud links rather than large attachments. Integration with Google Meet enables one-click video conferencing directly from the email interface, while Google Chat facilitates instant messaging with team members. Advanced security features include two-factor authentication, confidential mode with expiration dates and passcodes, and security warnings for suspicious messages. Gmail's offline capability allows users to read, respond, and search emails without internet connectivity, with changes synchronizing once reconnected. For power users, keyboard shortcuts, multiple inboxes, scheduled sending, and email templates streamline workflow efficiency. The service's robust API enables third-party integrations with CRM systems, project management tools, and marketing platforms. With its generous 15GB of free storage shared across Google services, continuous innovation in AI-powered features, and unwavering commitment to security and reliability, Gmail has maintained its position as the gold standard in email communication for both personal and professional use worldwide.",
    "size": 90,
    "reviews": "30M",
    "ratingAvg": 4.5,
    "downloads": "10B",
    "ratings": [
      { "name": "1 star", "count": 1200000 },
      { "name": "2 star", "count": 800000 },
      { "name": "3 star", "count": 2000000 },
      { "name": "4 star", "count": 6000000 },
      { "name": "5 star", "count": 20000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/5hyHqywX/images-1.png",
    "title": "Google Maps",
    "companyName": "Google LLC",
    "id": 9,
    "description": "Google Maps represents one of the most technologically ambitious and practically essential applications in the digital landscape, comprehensively mapping our planet while providing indispensable navigation assistance to billions of users worldwide. The platform offers turn-by-turn navigation for driving, walking, cycling, and public transportation with real-time traffic conditions, accident reports, speed trap alerts, and road closure information. Google's extensive Street View imagery provides ground-level perspectives of locations globally, while satellite view offers detailed aerial photography. The service integrates comprehensive business information including hours of operation, contact details, photos, menus, and user reviews to help with destination planning. Google Maps' Explore tab suggests nearby restaurants, attractions, and activities based on time of day, popularity, and user preferences, with filters for price range, cuisine, and ratings. Saved places allow users to bookmark favorite locations and create custom lists for trips, while Timeline features provide a private history of visited places. For businesses, Google My Business enables management of listing information, responding to reviews, and posting updates to attract customers. Indoor maps are available for airports, shopping malls, and transit stations to assist with interior navigation. The platform's contribution tools allow users to add missing places, edit business information, upload photos, and answer questions about locations they've visited. Google Maps integrates with calendar events to provide timely departure alerts for appointments and reservations. Offline maps enable navigation in areas with limited connectivity by downloading specific regions for later use. The application's accessibility features include wheelchair-accessible routes, voice guidance for visually impaired users, and detailed information about venue accessibility. With its continuous expansion through new features like eco-friendly routing to reduce carbon emissions, augmented reality walking directions using Live View, and detailed information about COVID-19 safety measures at businesses, Google Maps has evolved from a simple navigation tool to an essential companion for exploration, daily commuting, trip planning, and local discovery that fundamentally enhances how we interact with and understand our physical world.",
    "size": 130,
    "reviews": "21M",
    "ratingAvg": 4.4,
    "downloads": "10B",
    "ratings": [
      { "name": "1 star", "count": 1000000 },
      { "name": "2 star", "count": 700000 },
      { "name": "3 star", "count": 2500000 },
      { "name": "4 star", "count": 5000000 },
      { "name": "5 star", "count": 16000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/jvW6bxYq/download-3.png",
    "title": "X (Twitter)",
    "companyName": "X Corp.",
    "id": 10,
    "description": "X, formerly known as Twitter, has established itself as the digital public square where real-time conversations shape global discourse, break news, and forge cultural movements. This microblogging platform enables users to share thoughts, images, videos, and links through posts limited to 280 characters, creating a fast-paced environment of concise communication. The chronological timeline presents tweets from followed accounts, while the Explore tab surfaces trending topics, breaking news, and popular conversations tailored to user interests. X's unique retweet function allows content to spread virally across the platform, while quote tweets enable adding commentary to shared posts. The platform has become indispensable for journalists, politicians, celebrities, and activists to communicate directly with their audiences without media filtration. X Spaces provides live audio conversation rooms where users can participate as speakers or listeners, fostering community engagement through voice rather than text. Communities function allows users to create and join groups centered around specific interests, hobbies, or identities. The platform's Lists feature enables curating timelines from selected accounts without following them, ideal for tracking specific topics or people. X Premium (formerly Twitter Blue) offers additional features including edit tweet functionality, longer video uploads, reader mode for extended threads, and custom app icons. For content creators, X provides monetization opportunities through Super Follows for exclusive content and Ads Revenue Sharing for popular accounts. The platform's advanced search operators allow pinpointing specific tweets by date, location, engagement metrics, and keyword combinations. Safety tools include conversation controls, advanced blocking options, and content moderation filters. X's role in breaking news is unparalleled, with events often unfolding on the platform before traditional media coverage. The service has fundamentally transformed how people consume information, engage with public figures, participate in cultural conversations, and mobilize around social causes, serving as both a global news wire and intimate community space where voices from all backgrounds can contribute to the ever-evolving tapestry of digital public discourse in our interconnected world.",
    "size": 140,
    "reviews": "15M",
    "ratingAvg": 4.0,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": 1500000 },
      { "name": "2 star", "count": 900000 },
      { "name": "3 star", "count": 2500000 },
      { "name": "4 star", "count": 4000000 },
      { "name": "5 star", "count": 8000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/TMz00cSR/images.jpg",
    "title": "Zoom",
    "companyName": "Zoom Video Communications",
    "id": 11,
    "description": "Zoom has fundamentally transformed remote communication, emerging as the definitive video conferencing platform that powers virtual meetings, online education, telehealth services, and social connections across global boundaries. The service delivers exceptional video and audio quality through sophisticated compression technology that maintains clarity even with limited bandwidth. Zoom Meetings support up to 100 participants in the basic plan and up to 1,000 with enterprise licenses, featuring gallery view that displays multiple participants simultaneously and speaker view that automatically highlights the active speaker. The platform's virtual background technology allows users to replace their actual environment with custom images or videos, while beauty touch-up features provide real-time appearance enhancement. Screen sharing capabilities extend beyond basic desktop mirroring to include specific application windows, whiteboard collaboration, iPhone/iScreen screen mirroring, and portion-based sharing for focused presentations. Breakout Rooms enable meeting hosts to divide participants into smaller groups for discussions, then seamlessly reunite the main session. Recording functionality captures meetings locally or to the cloud with automatic transcription and searchable text. Zoom's security features include waiting rooms for participant vetting, passcode protection, end-to-end encryption for all meetings, and host controls for managing participant permissions. Integration with calendar systems allows one-click joining from scheduled events, while scheduling assistants help find optimal meeting times across time zones. Zoom Webinars support large-scale virtual events with registration pages, Q&A modules, and polling features for audience engagement. The platform's accessibility commitment includes closed captioning, keyboard shortcuts, and screen reader compatibility. Zoom Phone provides cloud telephony with traditional phone system features, while Zoom Rooms power conference room systems with calendar integration and touchless meeting initiation. Zoom Apps integrate third-party tools directly within meetings, while Developer APIs enable custom solutions. Through its reliable performance, intuitive interface, and continuous innovation, Zoom has become the infrastructure supporting the new era of hybrid work, distance learning, telemedicine, and virtual socializing, fundamentally reshaping how people connect, collaborate, and maintain relationships regardless of physical location in our increasingly digital world.",
    "size": 100,
    "reviews": "18M",
    "ratingAvg": 4.3,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": 900000 },
      { "name": "2 star", "count": 600000 },
      { "name": "3 star", "count": 1800000 },
      { "name": "4 star", "count": 3000000 },
      { "name": "5 star", "count": 12000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/fzd7P0yk/download-4.png",
    "title": "LinkedIn",
    "companyName": "LinkedIn Corporation",
    "id": 12,
    "description": "LinkedIn has established itself as the world's premier professional networking platform, creating an indispensable ecosystem where career development, business connections, and industry knowledge converge to empower professional growth. This comprehensive platform enables users to build detailed digital resumes through profiles that showcase work experience, education, skills, certifications, accomplishments, and recommendations from colleagues. The News Feed delivers professionally relevant content including industry news, company updates, and posts from connections, with algorithms prioritizing content that sparks meaningful professional conversations. LinkedIn's robust job search functionality allows filtering by experience level, company, location, industry, and remote work availability, while Easy Apply streamlines application processes and job alerts notify users of new postings matching their criteria. The platform's networking capabilities include connection requests, introduction features through mutual contacts, and Alumni Tool for reconnecting with former classmates. LinkedIn Learning provides access to thousands of expert-led courses covering business, technology, and creative skills with personalized recommendations based on career goals. Company Pages enable organizations to showcase their culture, share updates, post job openings, and analyze follower demographics. Sales Navigator offers advanced lead generation and relationship management tools for sales professionals, while Recruiter provides powerful candidate search and pipeline management for talent acquisition specialists. Content creation tools allow publishing long-form articles, sharing multimedia posts, and creating newsletters to establish thought leadership. LinkedIn Groups facilitate community building around professional interests, industries, and affiliations, while Events platform supports virtual and in-person professional gatherings. The service's premium subscriptions offer enhanced features including InMail messaging to members outside your network, detailed profile viewing analytics, and advanced search filters. LinkedIn's identity as Microsoft's professional social network enables seamless integration with Office 365, while its advertising platform delivers precise targeting based on professional demographics. With its continuous expansion through features like LinkedIn Live for video broadcasting, Skill Assessments for validating capabilities, and Career Explorer for planning career transitions, LinkedIn has evolved beyond a digital resume repository to become an essential career management tool that facilitates connections, knowledge sharing, opportunity discovery, and professional development for the global workforce in the digital age.",
    "size": 160,
    "reviews": "12M",
    "ratingAvg": 4.5,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": 600000 },
      { "name": "2 star", "count": 400000 },
      { "name": "3 star", "count": 1000000 },
      { "name": "4 star", "count": 2500000 },
      { "name": "5 star", "count": 7500000 }
    ]
  }
]